{"config": {"input_layers": [["cifar", 0, 0]], "layers": [{"config": {"input_dtype": "float32", "sparse": false, "name": "cifar", "batch_input_shape": [null, 80, 160, 3]}, "inbound_nodes": [], "name": "cifar", "class_name": "InputLayer"}, {"config": {"input_dtype": "float32", "trainable": true, "name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 80, 160, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa6/home/dat/Documents/behavioral-cloning/model/DatNet.py\u00da\b<lambda>\u0095\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape": null}, "inbound_nodes": [[["cifar", 0, 0]]], "name": "lambda_1", "class_name": "Lambda"}, {"config": {"trainable": true, "cropping": [[30, 5], [1, 1]], "name": "cropping2d_1"}, "inbound_nodes": [[["lambda_1", 0, 0]]], "name": "cropping2d_1", "class_name": "Cropping2D"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 5, "W_constraint": null, "activation": "linear", "nb_row": 5, "bias": false, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv0", "subsample": [2, 2], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["cropping2d_1", 0, 0]]], "name": "conv0", "class_name": "Convolution2D"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bn0", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["conv0", 0, 0]]], "name": "bn0", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "relu0"}, "inbound_nodes": [[["bn0", 0, 0]]], "name": "relu0", "class_name": "Activation"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 1, "W_constraint": null, "activation": "linear", "nb_row": 1, "bias": false, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv1a", "subsample": [1, 1], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["relu0", 0, 0]]], "name": "conv1a", "class_name": "Convolution2D"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bn1b", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["conv1a", 0, 0]]], "name": "bn1b", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "relu1b"}, "inbound_nodes": [[["bn1b", 0, 0]]], "name": "relu1b", "class_name": "Activation"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 3, "W_constraint": null, "activation": "linear", "nb_row": 3, "bias": false, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv1b", "subsample": [1, 1], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["relu1b", 0, 0]]], "name": "conv1b", "class_name": "Convolution2D"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bn1c", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["conv1b", 0, 0]]], "name": "bn1c", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "relu1c"}, "inbound_nodes": [[["bn1c", 0, 0]]], "name": "relu1c", "class_name": "Activation"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 1, "W_constraint": null, "activation": "linear", "nb_row": 1, "bias": true, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv1c", "subsample": [1, 1], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["relu1c", 0, 0]]], "name": "conv1c", "class_name": "Convolution2D"}, {"config": {"concat_axis": -1, "dot_axes": -1, "name": "+1", "output_shape_type": "raw", "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "mode": "sum", "arguments": {}, "output_shape": null}, "inbound_nodes": [[["conv1c", 0, 0], ["relu0", 0, 0]]], "name": "+1", "class_name": "Merge"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bn2a", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["+1", 0, 0]]], "name": "bn2a", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "relu2a"}, "inbound_nodes": [[["bn2a", 0, 0]]], "name": "relu2a", "class_name": "Activation"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 1, "W_constraint": null, "activation": "linear", "nb_row": 1, "bias": false, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv2a", "subsample": [1, 1], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["relu2a", 0, 0]]], "name": "conv2a", "class_name": "Convolution2D"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bn2b", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["conv2a", 0, 0]]], "name": "bn2b", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "relu2b"}, "inbound_nodes": [[["bn2b", 0, 0]]], "name": "relu2b", "class_name": "Activation"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 3, "W_constraint": null, "activation": "linear", "nb_row": 3, "bias": false, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv2b", "subsample": [1, 1], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["relu2b", 0, 0]]], "name": "conv2b", "class_name": "Convolution2D"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bn2c", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["conv2b", 0, 0]]], "name": "bn2c", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "relu2c"}, "inbound_nodes": [[["bn2c", 0, 0]]], "name": "relu2c", "class_name": "Activation"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 1, "W_constraint": null, "activation": "linear", "nb_row": 1, "bias": true, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv2c", "subsample": [1, 1], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["relu2c", 0, 0]]], "name": "conv2c", "class_name": "Convolution2D"}, {"config": {"concat_axis": -1, "dot_axes": -1, "name": "+2", "output_shape_type": "raw", "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "mode": "sum", "arguments": {}, "output_shape": null}, "inbound_nodes": [[["conv2c", 0, 0], ["+1", 0, 0]]], "name": "+2", "class_name": "Merge"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bn3a", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["+2", 0, 0]]], "name": "bn3a", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "relu3a"}, "inbound_nodes": [[["bn3a", 0, 0]]], "name": "relu3a", "class_name": "Activation"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 1, "W_constraint": null, "activation": "linear", "nb_row": 1, "bias": false, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv3a", "subsample": [1, 1], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["relu3a", 0, 0]]], "name": "conv3a", "class_name": "Convolution2D"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bn3b", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["conv3a", 0, 0]]], "name": "bn3b", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "relu3b"}, "inbound_nodes": [[["bn3b", 0, 0]]], "name": "relu3b", "class_name": "Activation"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 3, "W_constraint": null, "activation": "linear", "nb_row": 3, "bias": false, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv3b", "subsample": [1, 1], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["relu3b", 0, 0]]], "name": "conv3b", "class_name": "Convolution2D"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bn3c", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["conv3b", 0, 0]]], "name": "bn3c", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "relu3c"}, "inbound_nodes": [[["bn3c", 0, 0]]], "name": "relu3c", "class_name": "Activation"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 1, "W_constraint": null, "activation": "linear", "nb_row": 1, "bias": true, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv3c", "subsample": [1, 1], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["relu3c", 0, 0]]], "name": "conv3c", "class_name": "Convolution2D"}, {"config": {"concat_axis": -1, "dot_axes": -1, "name": "+3", "output_shape_type": "raw", "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "mode": "sum", "arguments": {}, "output_shape": null}, "inbound_nodes": [[["conv3c", 0, 0], ["+2", 0, 0]]], "name": "+3", "class_name": "Merge"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bn4a", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["+3", 0, 0]]], "name": "bn4a", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "relu4a"}, "inbound_nodes": [[["bn4a", 0, 0]]], "name": "relu4a", "class_name": "Activation"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 1, "W_constraint": null, "activation": "linear", "nb_row": 1, "bias": false, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv4a", "subsample": [1, 1], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["relu4a", 0, 0]]], "name": "conv4a", "class_name": "Convolution2D"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bn4b", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["conv4a", 0, 0]]], "name": "bn4b", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "relu4b"}, "inbound_nodes": [[["bn4b", 0, 0]]], "name": "relu4b", "class_name": "Activation"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 3, "W_constraint": null, "activation": "linear", "nb_row": 3, "bias": false, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv4b", "subsample": [1, 1], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["relu4b", 0, 0]]], "name": "conv4b", "class_name": "Convolution2D"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bn4c", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["conv4b", 0, 0]]], "name": "bn4c", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "relu4c"}, "inbound_nodes": [[["bn4c", 0, 0]]], "name": "relu4c", "class_name": "Activation"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "nb_col": 1, "W_constraint": null, "activation": "linear", "nb_row": 1, "bias": true, "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "conv4c", "subsample": [1, 1], "init": "glorot_normal", "nb_filter": 32}, "inbound_nodes": [[["relu4c", 0, 0]]], "name": "conv4c", "class_name": "Convolution2D"}, {"config": {"concat_axis": -1, "dot_axes": -1, "name": "+4", "output_shape_type": "raw", "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "mode": "sum", "arguments": {}, "output_shape": null}, "inbound_nodes": [[["conv4c", 0, 0], ["+3", 0, 0]]], "name": "+4", "class_name": "Merge"}, {"config": {"axis": 1, "trainable": true, "beta_regularizer": null, "name": "bnF", "momentum": 0.99, "epsilon": 0.001, "mode": 2, "gamma_regularizer": null}, "inbound_nodes": [[["+4", 0, 0]]], "name": "bnF", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "reluF"}, "inbound_nodes": [[["bnF", 0, 0]]], "name": "reluF", "class_name": "Activation"}, {"config": {"pool_size": [22.5, 22.5], "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "avg_pool", "strides": [22.5, 22.5]}, "inbound_nodes": [[["reluF", 0, 0]]], "name": "avg_pool", "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "name": "flat"}, "inbound_nodes": [[["avg_pool", 0, 0]]], "name": "flat", "class_name": "Flatten"}, {"config": {"b_regularizer": null, "input_dim": 96.0, "output_dim": 1024, "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "fc1", "b_constraint": null}, "inbound_nodes": [[["flat", 0, 0]]], "name": "fc1", "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "inbound_nodes": [[["fc1", 0, 0]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"b_regularizer": null, "input_dim": 1024, "output_dim": 512, "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "fc2", "b_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "fc2", "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "inbound_nodes": [[["fc2", 0, 0]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"b_regularizer": null, "input_dim": 512, "output_dim": 256, "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "fc3", "b_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "fc3", "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "inbound_nodes": [[["fc3", 0, 0]]], "name": "dropout_3", "class_name": "Dropout"}, {"config": {"b_regularizer": null, "input_dim": 256, "output_dim": 3, "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "output_2", "b_constraint": null}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "output_2", "class_name": "Dense"}], "name": "model_1", "output_layers": [["output_2", 0, 0]]}, "keras_version": "1.2.0", "class_name": "Model"}