{"keras_version": "1.2.0", "class_name": "Model", "config": {"input_layers": [["cifar", 0, 0]], "output_layers": [["output_1", 0, 0]], "name": "model_1", "layers": [{"name": "cifar", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 46, 160, 3], "input_dtype": "float32", "sparse": false, "name": "cifar"}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"output_shape": null, "batch_input_shape": [null, 46, 160, 3], "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa6/home/dat/Documents/behavioral-cloning/model/DatNet.py\u00da\b<lambda>\u0099\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "name": "lambda_1", "output_shape_type": "raw", "trainable": true, "function_type": "lambda"}, "inbound_nodes": [[["cifar", 0, 0]]]}, {"name": "conv0", "class_name": "Convolution2D", "config": {"subsample": [2, 2], "W_constraint": null, "nb_col": 5, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 5, "activity_regularizer": null, "nb_filter": 32, "border_mode": "same", "b_constraint": null, "init": "glorot_normal", "name": "conv0", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": false, "dim_ordering": "tf"}, "inbound_nodes": [[["lambda_1", 0, 0]]]}, {"name": "bn0", "class_name": "BatchNormalization", "config": {"name": "bn0", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["conv0", 0, 0]]]}, {"name": "relu0", "class_name": "Activation", "config": {"trainable": true, "name": "relu0", "activation": "relu"}, "inbound_nodes": [[["bn0", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.4}, "inbound_nodes": [[["relu0", 0, 0]]]}, {"name": "conv1a", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 1, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 1, "activity_regularizer": null, "nb_filter": 32, "border_mode": "valid", "b_constraint": null, "init": "glorot_normal", "name": "conv1a", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": false, "dim_ordering": "tf"}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "bn1b", "class_name": "BatchNormalization", "config": {"name": "bn1b", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["conv1a", 0, 0]]]}, {"name": "relu1b", "class_name": "Activation", "config": {"trainable": true, "name": "relu1b", "activation": "relu"}, "inbound_nodes": [[["bn1b", 0, 0]]]}, {"name": "conv1b", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 3, "activity_regularizer": null, "nb_filter": 32, "border_mode": "same", "b_constraint": null, "init": "glorot_normal", "name": "conv1b", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": false, "dim_ordering": "tf"}, "inbound_nodes": [[["relu1b", 0, 0]]]}, {"name": "bn1c", "class_name": "BatchNormalization", "config": {"name": "bn1c", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["conv1b", 0, 0]]]}, {"name": "relu1c", "class_name": "Activation", "config": {"trainable": true, "name": "relu1c", "activation": "relu"}, "inbound_nodes": [[["bn1c", 0, 0]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.4}, "inbound_nodes": [[["relu1c", 0, 0]]]}, {"name": "conv1c", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 1, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 1, "activity_regularizer": null, "nb_filter": 32, "border_mode": "valid", "b_constraint": null, "init": "glorot_normal", "name": "conv1c", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": true, "dim_ordering": "tf"}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "+1", "class_name": "Merge", "config": {"dot_axes": -1, "output_shape": null, "arguments": {}, "output_mask_type": "raw", "output_shape_type": "raw", "name": "+1", "concat_axis": -1, "mode_type": "raw", "mode": "sum", "output_mask": null}, "inbound_nodes": [[["conv1c", 0, 0], ["dropout_1", 0, 0]]]}, {"name": "bn2a", "class_name": "BatchNormalization", "config": {"name": "bn2a", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["+1", 0, 0]]]}, {"name": "relu2a", "class_name": "Activation", "config": {"trainable": true, "name": "relu2a", "activation": "relu"}, "inbound_nodes": [[["bn2a", 0, 0]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.4}, "inbound_nodes": [[["relu2a", 0, 0]]]}, {"name": "conv2a", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 1, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 1, "activity_regularizer": null, "nb_filter": 32, "border_mode": "valid", "b_constraint": null, "init": "glorot_normal", "name": "conv2a", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": false, "dim_ordering": "tf"}, "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"name": "bn2b", "class_name": "BatchNormalization", "config": {"name": "bn2b", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["conv2a", 0, 0]]]}, {"name": "relu2b", "class_name": "Activation", "config": {"trainable": true, "name": "relu2b", "activation": "relu"}, "inbound_nodes": [[["bn2b", 0, 0]]]}, {"name": "conv2b", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 3, "activity_regularizer": null, "nb_filter": 32, "border_mode": "same", "b_constraint": null, "init": "glorot_normal", "name": "conv2b", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": false, "dim_ordering": "tf"}, "inbound_nodes": [[["relu2b", 0, 0]]]}, {"name": "bn2c", "class_name": "BatchNormalization", "config": {"name": "bn2c", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["conv2b", 0, 0]]]}, {"name": "relu2c", "class_name": "Activation", "config": {"trainable": true, "name": "relu2c", "activation": "relu"}, "inbound_nodes": [[["bn2c", 0, 0]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.4}, "inbound_nodes": [[["relu2c", 0, 0]]]}, {"name": "conv2c", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 1, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 1, "activity_regularizer": null, "nb_filter": 32, "border_mode": "valid", "b_constraint": null, "init": "glorot_normal", "name": "conv2c", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": true, "dim_ordering": "tf"}, "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"name": "+2", "class_name": "Merge", "config": {"dot_axes": -1, "output_shape": null, "arguments": {}, "output_mask_type": "raw", "output_shape_type": "raw", "name": "+2", "concat_axis": -1, "mode_type": "raw", "mode": "sum", "output_mask": null}, "inbound_nodes": [[["conv2c", 0, 0], ["+1", 0, 0]]]}, {"name": "bn3a", "class_name": "BatchNormalization", "config": {"name": "bn3a", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["+2", 0, 0]]]}, {"name": "relu3a", "class_name": "Activation", "config": {"trainable": true, "name": "relu3a", "activation": "relu"}, "inbound_nodes": [[["bn3a", 0, 0]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.4}, "inbound_nodes": [[["relu3a", 0, 0]]]}, {"name": "conv3a", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 1, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 1, "activity_regularizer": null, "nb_filter": 32, "border_mode": "valid", "b_constraint": null, "init": "glorot_normal", "name": "conv3a", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": false, "dim_ordering": "tf"}, "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"name": "bn3b", "class_name": "BatchNormalization", "config": {"name": "bn3b", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["conv3a", 0, 0]]]}, {"name": "relu3b", "class_name": "Activation", "config": {"trainable": true, "name": "relu3b", "activation": "relu"}, "inbound_nodes": [[["bn3b", 0, 0]]]}, {"name": "conv3b", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 3, "activity_regularizer": null, "nb_filter": 32, "border_mode": "same", "b_constraint": null, "init": "glorot_normal", "name": "conv3b", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": false, "dim_ordering": "tf"}, "inbound_nodes": [[["relu3b", 0, 0]]]}, {"name": "bn3c", "class_name": "BatchNormalization", "config": {"name": "bn3c", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["conv3b", 0, 0]]]}, {"name": "relu3c", "class_name": "Activation", "config": {"trainable": true, "name": "relu3c", "activation": "relu"}, "inbound_nodes": [[["bn3c", 0, 0]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.4}, "inbound_nodes": [[["relu3c", 0, 0]]]}, {"name": "conv3c", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 1, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 1, "activity_regularizer": null, "nb_filter": 32, "border_mode": "valid", "b_constraint": null, "init": "glorot_normal", "name": "conv3c", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": true, "dim_ordering": "tf"}, "inbound_nodes": [[["dropout_6", 0, 0]]]}, {"name": "+3", "class_name": "Merge", "config": {"dot_axes": -1, "output_shape": null, "arguments": {}, "output_mask_type": "raw", "output_shape_type": "raw", "name": "+3", "concat_axis": -1, "mode_type": "raw", "mode": "sum", "output_mask": null}, "inbound_nodes": [[["conv3c", 0, 0], ["+2", 0, 0]]]}, {"name": "bn4a", "class_name": "BatchNormalization", "config": {"name": "bn4a", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["+3", 0, 0]]]}, {"name": "relu4a", "class_name": "Activation", "config": {"trainable": true, "name": "relu4a", "activation": "relu"}, "inbound_nodes": [[["bn4a", 0, 0]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "p": 0.4}, "inbound_nodes": [[["relu4a", 0, 0]]]}, {"name": "conv4a", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 1, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 1, "activity_regularizer": null, "nb_filter": 32, "border_mode": "valid", "b_constraint": null, "init": "glorot_normal", "name": "conv4a", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": false, "dim_ordering": "tf"}, "inbound_nodes": [[["dropout_7", 0, 0]]]}, {"name": "bn4b", "class_name": "BatchNormalization", "config": {"name": "bn4b", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["conv4a", 0, 0]]]}, {"name": "relu4b", "class_name": "Activation", "config": {"trainable": true, "name": "relu4b", "activation": "relu"}, "inbound_nodes": [[["bn4b", 0, 0]]]}, {"name": "conv4b", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 3, "activity_regularizer": null, "nb_filter": 32, "border_mode": "same", "b_constraint": null, "init": "glorot_normal", "name": "conv4b", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": false, "dim_ordering": "tf"}, "inbound_nodes": [[["relu4b", 0, 0]]]}, {"name": "bn4c", "class_name": "BatchNormalization", "config": {"name": "bn4c", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["conv4b", 0, 0]]]}, {"name": "relu4c", "class_name": "Activation", "config": {"trainable": true, "name": "relu4c", "activation": "relu"}, "inbound_nodes": [[["bn4c", 0, 0]]]}, {"name": "dropout_8", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "p": 0.4}, "inbound_nodes": [[["relu4c", 0, 0]]]}, {"name": "conv4c", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 1, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0}, "nb_row": 1, "activity_regularizer": null, "nb_filter": 32, "border_mode": "valid", "b_constraint": null, "init": "glorot_normal", "name": "conv4c", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": true, "dim_ordering": "tf"}, "inbound_nodes": [[["dropout_8", 0, 0]]]}, {"name": "+4", "class_name": "Merge", "config": {"dot_axes": -1, "output_shape": null, "arguments": {}, "output_mask_type": "raw", "output_shape_type": "raw", "name": "+4", "concat_axis": -1, "mode_type": "raw", "mode": "sum", "output_mask": null}, "inbound_nodes": [[["conv4c", 0, 0], ["+3", 0, 0]]]}, {"name": "bnF", "class_name": "BatchNormalization", "config": {"name": "bnF", "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "axis": 1, "mode": 2, "momentum": 0.99}, "inbound_nodes": [[["+4", 0, 0]]]}, {"name": "reluF", "class_name": "Activation", "config": {"trainable": true, "name": "reluF", "activation": "relu"}, "inbound_nodes": [[["bnF", 0, 0]]]}, {"name": "dropout_9", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_9", "p": 0.4}, "inbound_nodes": [[["reluF", 0, 0]]]}, {"name": "avg_pool", "class_name": "AveragePooling2D", "config": {"strides": [23.0, 23.0], "pool_size": [23.0, 23.0], "name": "avg_pool", "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}, "inbound_nodes": [[["dropout_9", 0, 0]]]}, {"name": "flat", "class_name": "Flatten", "config": {"trainable": true, "name": "flat"}, "inbound_nodes": [[["avg_pool", 0, 0]]]}, {"name": "fc1", "class_name": "Dense", "config": {"input_dim": 96.0, "W_constraint": null, "W_regularizer": null, "output_dim": 1024, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "name": "fc1", "trainable": true, "b_regularizer": null, "activation": "relu", "bias": true}, "inbound_nodes": [[["flat", 0, 0]]]}, {"name": "dropout_10", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_10", "p": 0.5}, "inbound_nodes": [[["fc1", 0, 0]]]}, {"name": "fc2", "class_name": "Dense", "config": {"input_dim": 1024, "W_constraint": null, "W_regularizer": null, "output_dim": 512, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "name": "fc2", "trainable": true, "b_regularizer": null, "activation": "relu", "bias": true}, "inbound_nodes": [[["dropout_10", 0, 0]]]}, {"name": "dropout_11", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_11", "p": 0.5}, "inbound_nodes": [[["fc2", 0, 0]]]}, {"name": "fc3", "class_name": "Dense", "config": {"input_dim": 512, "W_constraint": null, "W_regularizer": null, "output_dim": 256, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "name": "fc3", "trainable": true, "b_regularizer": null, "activation": "relu", "bias": true}, "inbound_nodes": [[["dropout_11", 0, 0]]]}, {"name": "dropout_12", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_12", "p": 0.5}, "inbound_nodes": [[["fc3", 0, 0]]]}, {"name": "output_1", "class_name": "Dense", "config": {"input_dim": 256, "W_constraint": null, "W_regularizer": null, "output_dim": 3, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "name": "output_1", "trainable": true, "b_regularizer": null, "activation": "linear", "bias": true}, "inbound_nodes": [[["dropout_12", 0, 0]]]}]}}