{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 46, 160, 3], "input_dtype": "float32", "sparse": false, "name": "cifar"}, "inbound_nodes": [], "name": "cifar"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0015d\u0002\u0000\u0018S(\u0003\u0000\u0000\u0000Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0005\u0000\u0000\u0000image(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\b\u0000\u0000\u0000model.pyt\b\u0000\u0000\u0000<lambda>(\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "batch_input_shape": [null, 46, 160, 3], "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["cifar", 0, 0]]], "name": "lambda_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv0", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "init": "he_uniform", "bias": false, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["lambda_1", 0, 0]]], "name": "conv0"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn0", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv0", 0, 0]]], "name": "bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu0"}, "inbound_nodes": [[["bn0", 0, 0]]], "name": "relu0"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["relu0", 0, 0]]], "name": "dropout_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "conv1a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn1b", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv1a", 0, 0]]], "name": "bn1b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu1b"}, "inbound_nodes": [[["bn1b", 0, 0]]], "name": "relu1b"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["relu1b", 0, 0]]], "name": "conv1b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn1c", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv1b", 0, 0]]], "name": "bn1c"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu1c"}, "inbound_nodes": [[["bn1c", 0, 0]]], "name": "relu1c"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["relu1c", 0, 0]]], "name": "dropout_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "conv1c"}, {"class_name": "Merge", "config": {"name": "+1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv1c", 0, 0], ["dropout_1", 0, 0]]], "name": "+1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["+1", 0, 0]]], "name": "bn2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu2a"}, "inbound_nodes": [[["bn2a", 0, 0]]], "name": "relu2a"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["relu2a", 0, 0]]], "name": "dropout_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "conv2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2b", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2a", 0, 0]]], "name": "bn2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu2b"}, "inbound_nodes": [[["bn2b", 0, 0]]], "name": "relu2b"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["relu2b", 0, 0]]], "name": "conv2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2c", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2b", 0, 0]]], "name": "bn2c"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu2c"}, "inbound_nodes": [[["bn2c", 0, 0]]], "name": "relu2c"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["relu2c", 0, 0]]], "name": "dropout_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "conv2c"}, {"class_name": "Merge", "config": {"name": "+2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv2c", 0, 0], ["+1", 0, 0]]], "name": "+2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3a", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["+2", 0, 0]]], "name": "bn3a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu3a"}, "inbound_nodes": [[["bn3a", 0, 0]]], "name": "relu3a"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["relu3a", 0, 0]]], "name": "dropout_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv3a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_5", 0, 0]]], "name": "conv3a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3b", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv3a", 0, 0]]], "name": "bn3b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu3b"}, "inbound_nodes": [[["bn3b", 0, 0]]], "name": "relu3b"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv3b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["relu3b", 0, 0]]], "name": "conv3b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3c", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv3b", 0, 0]]], "name": "bn3c"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu3c"}, "inbound_nodes": [[["bn3c", 0, 0]]], "name": "relu3c"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["relu3c", 0, 0]]], "name": "dropout_6"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv3c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "conv3c"}, {"class_name": "Merge", "config": {"name": "+3", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv3c", 0, 0], ["+2", 0, 0]]], "name": "+3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4a", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["+3", 0, 0]]], "name": "bn4a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu4a"}, "inbound_nodes": [[["bn4a", 0, 0]]], "name": "relu4a"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_7"}, "inbound_nodes": [[["relu4a", 0, 0]]], "name": "dropout_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv4a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_7", 0, 0]]], "name": "conv4a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4b", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv4a", 0, 0]]], "name": "bn4b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu4b"}, "inbound_nodes": [[["bn4b", 0, 0]]], "name": "relu4b"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv4b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["relu4b", 0, 0]]], "name": "conv4b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4c", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv4b", 0, 0]]], "name": "bn4c"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu4c"}, "inbound_nodes": [[["bn4c", 0, 0]]], "name": "relu4c"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_8"}, "inbound_nodes": [[["relu4c", 0, 0]]], "name": "dropout_8"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv4c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_8", 0, 0]]], "name": "conv4c"}, {"class_name": "Merge", "config": {"name": "+4", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv4c", 0, 0], ["+3", 0, 0]]], "name": "+4"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bnF", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["+4", 0, 0]]], "name": "bnF"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "reluF"}, "inbound_nodes": [[["bnF", 0, 0]]], "name": "reluF"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_9"}, "inbound_nodes": [[["reluF", 0, 0]]], "name": "dropout_9"}, {"class_name": "AveragePooling2D", "config": {"name": "avg_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [23, 23], "strides": [23, 23], "border_mode": "valid"}, "inbound_nodes": [[["dropout_9", 0, 0]]], "name": "avg_pool"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flat"}, "inbound_nodes": [[["avg_pool", 0, 0]]], "name": "flat"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "fc1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 96, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1024}, "inbound_nodes": [[["flat", 0, 0]]], "name": "fc1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_10"}, "inbound_nodes": [[["fc1", 0, 0]]], "name": "dropout_10"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "fc2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 512}, "inbound_nodes": [[["dropout_10", 0, 0]]], "name": "fc2"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_11"}, "inbound_nodes": [[["fc2", 0, 0]]], "name": "dropout_11"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "fc3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 256}, "inbound_nodes": [[["dropout_11", 0, 0]]], "name": "fc3"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_12"}, "inbound_nodes": [[["fc3", 0, 0]]], "name": "dropout_12"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "output_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 3}, "inbound_nodes": [[["dropout_12", 0, 0]]], "name": "output_1"}], "input_layers": [["cifar", 0, 0]], "output_layers": [["output_1", 0, 0]], "name": "model_1"}}